Autodesk.Revit.DB.Architecture.BuildingPad.SetBoundary(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Set a given curve loops as the boundary of the current BuildingPad element.
curveLoops:
A collection of curve loops to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the Sketch for the boundary of current BuildingPad.
-or-
Cannot find an appropriate hosting topography surface for this BuildingPad.
-or-
This topography surface cannot be the host of this BuildingPad.
-or-
The given curve loops intersect with curve loops of existing BuildingPads hosted on the same TopographySurface.
-or-
There is at least one existing SubRegion which is completely inside or overlap the boundary of current BuildingPad hosted on the same TopographySurface. This behavior is not allowed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing this BuildingPad is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing this BuildingPad is being loaded, or is in the midst of another
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing this BuildingPad has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.BuildingPad.GetBoundary
Gets the boundary of current BuildingPad element.
Returns:
The curve loops that represent the boundary of the BuildingPad.
Since:
2014

Autodesk.Revit.DB.Architecture.BuildingPad.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Creates a new BuildingPad element and adds it to the document.
Remarks:
The document will be regenerated during the creation of building pad element.
If the input curve loops intersect the curve loops of existing BuildingPads hosted on the same topography surface,
an InvalidOperationException will be thrown.
If you need access to the topography surface created by the introduction of this building pad, you can obtain it from
Autodesk.Revit.DB.Architecture.BuildingPad.AssociatedTopographySurfaceId.
document:
The document to be modified.
buildingPadTypeId:
The type id set to the BuildingPad.
levelId:
The level id set to the BuildingPad.
curveLoops:
The boundary of the BuildingPad.
Returns:
The new BuildingPad element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The buildingPadTypeId is not a valid type id for a BuildingPad.
-or-
The ElementId levelId is not a Level.
-or-
The input curve loops cannot compose a valid boundary, that means:
no curve loop is contained in the given collection;
these curve loops intersect with each other for some of them;
or each curve loop is not closed individually;
or each curve loop is not planar;
or each curve loop is not in a plane parallel to the horizontal(XY) plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the Sketch for the boundary of new created BuildingPad.
-or-
Cannot find an appropriate hosting topography surface for this BuildingPad.
-or-
This topography surface cannot be the host of this BuildingPad.
-or-
The given curve loops intersect with curve loops of existing BuildingPads hosted on the same TopographySurface.
-or-
There is at least one existing SubRegion which is completely inside or overlap the boundary of current BuildingPad hosted on the same TopographySurface. This behavior is not allowed.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.Architecture.BuildingPad.AssociatedTopographySurfaceId
The element id of a topography surface created by the introduction of this building pad.
Since:
2015

Autodesk.Revit.DB.Architecture.BuildingPad.HostId
The element id of the topography surface hosting this BuidlingPad.
Since:
2014

Autodesk.Revit.DB.Architecture.BuildingPad
Represents a BuildingPad element.
Since:
2014